import { IQuestionModel } from "@/shared/interfaces/question.interface";
interface IModel2 {
    id: string | number;
    text: string;
    answer: string;
    true_answer: string | null;
}
export const testsData: IQuestionModel[] = [
    {
        Answer: [
            {
                id: 14,
                text: "12",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 15,
                text: "14",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 16,
                text: "15",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 17,
                text: "16",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
        ],
        id: 5,
        text: "Сколько дивизий народного ополчения сформировали москвичи для защиты столицы на дальних и ближних подступах к осени 1941 года?",
        TypeMiniGame: {
            name: "Викторина",
            id: 4,
        },
    },
    {
        Answer: [
            {
                id: 14,
                text: "6",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 15,
                text: "9",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 16,
                text: "12",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 17,
                text: "16",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
        ],
        id: 5,
        text: "Сколько всего оборонительных полос было возведено на пути, наступающего по плану «Тайфун» врага?",
        TypeMiniGame: {
            name: "Викторина",
            id: 4,
        },
    },
    {
        Answer: [
            {
                id: 14,
                text: "Можайск и Истра",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 15,
                text: "Можайск и Истра",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 16,
                text: "Бородино и Тула",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 17,
                text: "Ясная Поляна и Волоколамск",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
        ],
        id: 5,
        text: "В советской историографии укрепилось мнение об огромном вкладе дальневосточных и сибирских дивизий в битву под Москвой. Пресса того времени восторженно писала о 32-й стрелковой дивизии (сд) полковников В.И.Полосухина и 78-й сд А.П.Белобородова. Где дрались с врагом эти соединения в ноябре-декабре 1941 года?",
        TypeMiniGame: {
            name: "Викторина",
            id: 4,
        },
    },
    {
        Answer: [
            {
                id: 14,
                text: "Ильинский",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 15,
                text: "Зушенский",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 16,
                text: "Волоколамский",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 17,
                text: "Павловский",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
        ],
        id: 5,
        text: "В ходе битвы за Москву подольские курсанты покрыли себя неувядаемой славой, обороняя подступы к столице. А как назывался рубеж, которые они обороняли?",
        TypeMiniGame: {
            name: "Викторина",
            id: 4,
        },
    },
    {
        Answer: [
            {
                id: 14,
                text: "Командовал - П. А. Артемьев, принимал - С. М. Будённый",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 15,
                text: "Командовал - К. Е. Ворошилов, принимал - И. В. Сталин",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 16,
                text: "Командовал - С. М. Будённый, принимал - Г. К. Жуков",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
        ],
        id: 5,
        text: "Назовите фамилии тех, кто командовал и принимал парад на Красной площади 7 ноября 1941 года",
        TypeMiniGame: {
            name: "Викторина",
            id: 4,
        },
    },

    {
        Answer: [
            {
                id: 14,
                text: "Огромные колонны войск из числа нового полонения, прибывших на фронт для ведения наступления",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 15,
                text: "Огромные колонны пленных германских солдат и офицеров",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 16,
                text: "Огромные колонны брошенных немцами автомашин и танков",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
        ],
        id: 5,
        text: "Во второй половине декабря 1941 г. прибывший в Москву британский министр иностранных дел А. Иден посетил один из участков советско-германского фронта в районе г. Клина. Что продемонстрировало советское командование министру?",
        TypeMiniGame: {
            name: "Викторина",
            id: 4,
        },
    },
    {
        Answer: [
            {
                id: 14,
                text: "Часть самолётов-истребителей в составе сухопутных войск",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 15,
                text: "Соединение эскадренных миноносцев в эскадре подчинённой Красной Армии",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
            {
                id: 16,
                text: "Военизированное добровольческое формирование для борьбы с десантами и диверсантами противника",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },

            {
                id: 17,
                text: "Формирование противодиверсионных водолазов в охране водного района (ОВР)",
                FileAnswer: {
                    id: 1,
                    url: "/paper.png",
                },
            },
        ],
        id: 5,
        text: "Что такое истребительный батальон?",
        TypeMiniGame: {
            name: "Викторина",
            id: 4,
        },
    },
];



export const trueAnswers: IModel2[] = [
    {
        id: 1,
        text: "Сколько дивизий народного ополчения сформировали москвичи для защиты столицы на дальних и ближних подступах к осени 1941 года?",
        answer: "16",
        true_answer: "16",
    },
    {
        id: 2,
        text: "Сколько всего оборонительных полос было возведено на пути, наступающего по плану «Тайфун» врага?",
        answer: "9",
        true_answer: "9",
    },
    {
        id: 3,
        text: "В советской историографии укрепилось мнение об огромном вкладе дальневосточных и сибирских дивизий в битву под Москвой. Пресса того времени восторженно писала о 32-й стрелковой дивизии (сд) полковников В.И.Полосухина и 78-й сд А.П.Белобородова. Где дрались с врагом эти соединения в ноябре-декабре 1941 года?",
        answer: "Можайск и Истра",
        true_answer: "Можайск и Истра",
    },
    {
        id: 4,
        text: "В ходе битвы за Москву подольские курсанты покрыли себя неувядаемой славой, обороняя подступы к столице. А как назывался рубеж, которые они обороняли?",
        answer: "Ильинский",
        true_answer: "Ильинский",
    },
    {
        id: 5,
        text: "Назовите фамилии тех, кто командовал и принимал парад на Красной площади 7 ноября 1941 года",
        answer: "Командовал - С. М. Будённый, принимал - Г. К. Жуков",
        true_answer: null,
    },
    {
        id: 6,
        text: "Во второй половине декабря 1941 г. прибывший в Москву британский министр иностранных дел А. Иден посетил один из участков советско-германского фронта в районе г. Клина. Что продемонстрировало советское командование министру?",
        answer: "Огромные колонны брошенных немцами автомашин и танков",
        true_answer: "Огромные колонны брошенных немцами автомашин и танков",
    },
    {
        id: 7,
        text: "Что такое истребительный батальон?",
        answer: "Военизированное добровольческое формирование для борьбы с десантами и диверсантами противника",
        true_answer:
            "Военизированное добровольческое формирование для борьбы с десантами и диверсантами противника",
    },
]; 